# Serie 2 : Panda Library
##### Ing. Jean Didier KOUAKOU /jeandidikouakou@gmail.com/+225 0555420217

### Before using this library, we have to import it !

In [40]:
import pandas as pd

### Exercise 1: Create a DataFrame with the following data:
•	Columns: "Name", "Age", "City" and 
•	Rows: ("Maxwell", 27, "Kumasi"), ("Zossin", 24, "Abomey") and ("Nafi", 23, "Ouaga")

In [41]:
items = {
    "Name" : ["Maxwell","Zossin", "Nafi"],
    "Age" : [27,24, 23],
    "City" : ["Maxwell","Abomey","Ouaga"]

}
df = pd.DataFrame(items)
print(df)

      Name  Age     City
0  Maxwell   27  Maxwell
1   Zossin   24   Abomey
2     Nafi   23    Ouaga

### Exercise 2: Using the DataFrame created in Exercise 1, display the first 2 rows

In [42]:
#df[:2]
# We can also use :
df.head(2) #The number between parentheses show the N first row you want to see.

      Name  Age     City
0  Maxwell   27  Maxwell
1   Zossin   24   Abomey

### Exercise 3: Calculate and print the average age of the people in the DataFrame

In [43]:
age = df['Age']
average = age.mean()
print(average)

24.666666666666668

### Exercise 4: Filter the DataFrame to show only the rows where the city is "Ouaga"

In [44]:
df[df['City']=='Ouaga']

   Name  Age   City
2  Nafi   23  Ouaga

### Exercise 5: Add a new column "Salary" to the DataFrame with arbitrary values, and display the updated DataFrame

In [45]:
df['Salary']=[229500, 229580, 229585]
print(df)

      Name  Age     City  Salary
0  Maxwell   27  Maxwell  229500
1   Zossin   24   Abomey  229580
2     Nafi   23    Ouaga  229585

### Exercise 6: Rename the column "City" to "Location" in the DataFrame and display the updated DataFrame

In [51]:
df.rename(columns= {'City':'Location'}, inplace=True)
print(df)

      Name  Age Location  Salary
0  Maxwell   27  Maxwell  229500
1   Zossin   24   Abomey  229580
2     Nafi   23    Ouaga  229585

### Exercise 7: Group the DataFrame by "City" and count the number of occurrences for each city

In [59]:
df.groupby("Location").size()

Location
Abomey     1
Maxwell    1
Ouaga      1
dtype: int64

### Exercise 8: Sort the DataFrame by the "Age" column in descending order and display the result

In [62]:
df.sort_values('Age', ascending=False)

      Name  Age Location  Salary
0  Maxwell   27  Maxwell  229500
1   Zossin   24   Abomey  229580
2     Nafi   23    Ouaga  229585

### Exercise 9: Save the DataFrame to a CSV file named "wascal_people.csv"

In [66]:
df.to_csv('wascal_people.csv', index=False)

### Exercise 10: Load the DataFrame from the "wascal_people.csv" file you created in Exercise 9 and display its contents.

In [67]:
data=pd.read_csv('wascal_people.csv')
data

      Name  Age Location  Salary
0  Maxwell   27  Maxwell  229500
1   Zossin   24   Abomey  229580
2     Nafi   23    Ouaga  229585

# Problem Serie 2

### Set up of data and libraries

In [93]:
import pandas as pd
data=pd.read_excel('data_serie2.xlsx')
data.head(2)

,Country,Energy Consumption (TWh),Renewable Energy (%),CO2 Emissions (Mt),Population (millions)
0,CountryA,450,30,50,67
1,CountryB,4000,20,500,331

### Exercise 1: Calculate the energy consumption per capita for each country. Display the results as a DataFrame

In [94]:
Energy_capita = (data['Energy Consumption (TWh)'])/(data['Population (millions)'])
data['Energy Consumption per Capita (MWh)']= Energy_capita
print(data[['Country', 'Energy Consumption (TWh)', 'Energy Consumption per Capita (MWh)']])

    Country  Energy Consumption (TWh)  Energy Consumption per Capita (MWh)
0  CountryA                       450                             6.716418
1  CountryB                      4000                            12.084592
2  CountryC                       600                             7.228916
3  CountryD                      6500                             4.517026
4  CountryE                      1200                             0.869565

### Exercise 2: Identify the country with the highest CO2 emissions per capita. Display the country and the amount of emissions per capita.

In [109]:
C02_capita = (data['CO2 Emissions (Mt)'])/(data['Population (millions)'])
data['C02 Emission per Capita (t)']= C02_capita
data_2=data.sort_values('C02 Emission per Capita (t)')
print(data_2[['Country', 'C02 Emission per Capita (t)']])

    Country  C02 Emission per Capita (t)
4  CountryE                     0.144928
3  CountryD                     0.625434
0  CountryA                     0.746269
2  CountryC                     0.963855
1  CountryB                     1.510574

### Exercise 3: Calculate the total renewable energy consumption for each country and display the results.

In [111]:
Total_Re_Cmpt = (data['Energy Consumption (TWh)'])*((data['Renewable Energy (%)'])/100)
data['RE Consumption (TWh)']= Total_Re_Cmpt
print(data[['Country', 'RE Consumption (TWh)']])

    Country  RE Consumption (TWh)
0  CountryA                 135.0
1  CountryB                 800.0
2  CountryC                 240.0
3  CountryD                1625.0
4  CountryE                 180.0

### Exercise 4: Calculate the correlation between total energy consumption and CO2 emissions. Interpret the result.

In [114]:
correlation = data['Energy Consumption (TWh)'].corr(data['CO2 Emissions (Mt)'])
print('The correlation between them is : ', correlation)
if correlation > 0 :
    print('The higher energy consumption, especially from fossil fuels, typically leads to higher emissions.')
elif correlation <0:
    print('The higher energy consumption, leads to lower emissions.')
else :
    print('No correlation between both variable')

The correlation between them is :  0.9964165158940975
The higher energy consumption, especially from fossil fuels, typically leads to higher emissions.

### Exercise 5: Suppose each country increases its energy consumption by 5% per year for 5 years. Calculate and display the projected energy consumption for each country after 5 years.

In [122]:
projected_consmpt=data['Energy Consumption (TWh)']*(1+0.05)**5
data['Projected Energy Consumption (TWh)']=projected_consmpt
print(data[['Country', 'Energy Consumption (TWh)','Projected Energy Consumption (TWh)']])

    Country  Energy Consumption (TWh)  Projected Energy Consumption (TWh)
0  CountryA                       450                          574.326703
1  CountryB                      4000                         5105.126250
2  CountryC                       600                          765.768938
3  CountryD                      6500                         8295.830156
4  CountryE                      1200                         1531.537875

### The End!